export default [
  {
    id: 0,
    countryFrom: "Корея",
    countryTo: "Москва",
    carModel: "Audi A7 45 TFSI",
    comment:
      "От души благодарю команду OnewayImport за то, что помогли обновить машину 🙌 Хотел обновиться на Audi A7 45 TFSI. Очень оперативно нашли несколько вариантов, подборщики выехали на место и полностью отсняли автомобиль. Что не мало важно, когда у меня возникли дополнительные вопросы через какое‑то время, то мы смогли договориться о повторном оперативном осмотре. В итоге, получилось подобрать отличную машину, с мини повреждением, но с большим дисконтом относительно рынка. Доволен. По процессу доставки все четко, видео и фото в течение самой доставки присылались. По процедуре таможни тоже все быстро и прозрачно. Ну и был доволен сервисом и процессом выдачи машины! Рекомендую!",
    social: true,
    socialNetwork: "@malakhov_nikita",
    socialIcon: "InstagramNegative.svg",
    socialAlt: "instagram icon",
    imgSrc: "CarsReview1.png",
    imgAlt: "фотографии машины отзыв 1",
  },
  {
    id: 1,
    countryFrom: "Германия",
    countryTo: "Москва",
    carModel: "BMW M3 xDrive Germany",
    comment:
      "Процесс подбора был быстрым, нашли не стандартный вариант цвета авто, техническим состоянием доволен полностью. Перед покупкой прислали очень много видео с детального осмотра!",
    social: true,
    socialNetwork: "@dpulya",
    socialIcon: "TelegramNegative.svg",
    socialAlt: "telegram icon",
    imgSrc: "CarsReview2.png",
    imgAlt: "фотографии машины отзыв 2",
  },
  {
    id: 2,
    countryFrom: "Германия",
    countryTo: "Самара",
    carModel: "Mercedes Benz E350",
    comment:
      "Подбор и покупка автомобиля прошли отлично. Спасибо вам за оперативную доставку, помощь в выборе авто! Буду рекомендовать своим знакомым однозначно",
    social: true,
    socialNetwork: "@dpulya",
    socialIcon: "TelegramNegative.svg",
    socialAlt: "telegram icon",
    imgSrc: "CarsReview3.png",
    imgAlt: "фотографии машины отзыв 3",
  },
  {
    id: 3,
    countryFrom: "Корея",
    countryTo: "Москва",
    carModel: "Mercedes-AMG GT 43 4MATIC+",
    comment:
      "Я заказал машину в компании One Way Import. И что могу сказать, Машину привезли очень быстро, прям в кратчайшие сроки. Проверили ее вдоль и поперек. Проверили на все ошибки в компьютере. Проверили полностью кузов. Все, что могли проверить, проверили. Ребята молодцы, работают хорошо и качественно. И сразу видно, что они знают, что они делают. Советую всем заказывать здесь. Ну и, собственно, результатом доволен. Молодцы. Лайк. Подписка.",
    social: true,
    socialNetwork: "@andry_polo",
    socialIcon: "InstagramNegative.svg",
    socialAlt: "instagram icon",
    imgSrc: "CarsReview4.png",
    imgAlt: "фотографии машины отзыв 4",
  },
  {
    id: 4,
    countryFrom: "Корея",
    countryTo: "Москва",
    carModel: "BMW M4 xDrive",
    comment: `Покупал у вас машину в мае, привезли в сроки учитывая новогодние праздники
Подобрали и быстро выкупили
Машиной очень доволен. Это мой первый такой быстрый автомобиль.
Сервисом так же доволен, ребята сопровождали на каждом этапе и рассказывали почему конкретный автомобиль лучше других, учитывая все особенности данного авто относительно гражданской машины. Было ощущение, что я нахожусь во всех процессах и понимаю детали, для меня это было важно. Советую вас своим друзьям
Они сравнивают цены у вас и у других компаний, говорят что у вас лучше цены,
но при этом ничего не хромает, всё приезжает целое и в сроки, но главное сервис действительно премиальный.`,
    social: false,
    imgSrc: "CarsReview5.png",
    imgAlt: "фотографии машины отзыв 5",
  },
  {
    id: 5,
    countryFrom: "Корея",
    countryTo: "Москва",
    carModel: "BMW M340i 2",
    comment: `Доволен всем, с момента заказа машины, оперативного просмотра, детального отчета о машине перед оплатой, до доставки быстрой, со всех этапов были видео-отчеты
Катаюсь уже пару месяцев, машина идеальная, лучший вариант, который был на тот момент под мои запросы`,
    social: true,
    socialNetwork: "@offsultan",
    socialIcon: "InstagramNegative.svg",
    socialAlt: "instagram icon",
    imgSrc: "CarsReview6.png",
    imgAlt: "фотографии машины отзыв 6",
  },
  {
    id: 6,
    countryFrom: "Германия",
    countryTo: "Казань",
    carModel: "BMW X5 40D rest",
    comment: `Благодарю компанию One Way Import за помощь в приобретение BMW X5
Автомобиль привезли из Германии
Искал именно автомобиль в М пакете, чёрном цвете кузова и черного цвета салон
Обязательным требованием была модификация 40d
Смогли найти такой только в Германии, доставка с момента оплаты заняла примерно 5.5 недель
Процесс доставки сопровождался фото и видео отчетом
В подарок сделали полировку, химчистку, загрузили руссификацию и карты
Так же хочу отметить что ребята на связи и помогают с процессом дооснащения по сей день
Покупкой доволен, буду обращаться ещё 👍`,
    social: false,
    imgSrc: "CarsReview7.png",
    imgAlt: "фотографии машины отзыв 7",
  },
  {
    id: 7,
    countryFrom: "Корея",
    countryTo: "Казань",
    carModel: "Hyundai Palisad 2.2d 4wd rest",
    comment: `Palisade 2.2d 4wd Рестайлинг
2022.12г, на момент покупки пробег был около 13т

Покупкой доволен, ребятам огромное спасибо 🙏
Помогли осуществить давнюю хотелку, так как искал именно в сером цвете и чёрном салоне с минимальным пробегом. Обязательным критерием был рестайлинг.

В процессе доставки проблем не возникло, каждый этап сопровождался фото и видео отчетом. Переживал за таможню, так как с привозом авто из-за границы столкнулся впервые, но все прошло гладко, быстро и без проблем.
Срок доставки составил около 6 недель.

Буду рекомендовать друзьям, дай Бог вернусь ещё раз, спасибо 🙌`,
    social: false,
    imgSrc: "CarsReview8.png",
    imgAlt: "фотографии машины отзыв 8",
  },
  {
    id: 8,
    countryFrom: "Корея",
    countryTo: "Санкт-Петербург",
    carModel: "BMW X7 40d",
    comment: `Благодарю команду One Way Import за комплексную помощь в поиске и приобретении моего нового автомобиля.
Был долгий выбор модели с моей стороны. Сначала ребята подбирали мне варианты Q7 как в Европе, так и в Корее. Мы просматривали варианты, были оперативно предоставлены несколько вариантов понравившейся мне комплектации с описанием плюсов и минусов, особо понравившийся вариант был сразу же осмотрен в Корее, с предоставлением видео, фото и комментариев.
Затем я изменил решение на поиск не Audi Q7, а BMW X7, и Команда не потеряла интерес ко мне, как к "трудному" клиенту, а незамедлительно с энтузиазмом занялась поиском BMW X7. Без промедления мне были предоставлены варианты автомобилей, с объяснением ньюансов комплектации.`,
    social: false,
    imgSrc: "CarsReview9.png",
    imgAlt: "фотографии машины отзыв 9",
  },
];
